benchmark/generic-hash.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking granz.channel.it22.com (be patient)


Server Software:        nginx/1.14.2
Server Hostname:        granz.channel.it22.com
Server Port:            80

Document Path:          /generic-hash
Document Length:        624 bytes

Concurrency Level:      10
Time taken for tests:   0.365 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      152200 bytes
HTML transferred:       124800 bytes
Requests per second:    548.61 [#/sec] (mean)
Time per request:       18.228 [ms] (mean)
Time per request:       1.823 [ms] (mean, across all concurrent requests)
Transfer rate:          407.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   1.9      3       9
Processing:     3   14   3.3     13      27
Waiting:        0   14   3.3     13      27
Total:          4   18   4.1     18      31

Percentage of the requests served within a certain time (ms)
  50%     18
  66%     18
  75%     19
  80%     20
  90%     21
  95%     24
  98%     30
  99%     31
 100%     31 (longest request)