benchmark/ip-hash.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking granz.channel.it22.com (be patient)


Server Software:        nginx/1.14.2
Server Hostname:        granz.channel.it22.com
Server Port:            80

Document Path:          /ip-hash
Document Length:        624 bytes

Concurrency Level:      10
Time taken for tests:   0.342 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      152200 bytes
HTML transferred:       124800 bytes
Requests per second:    585.55 [#/sec] (mean)
Time per request:       17.078 [ms] (mean)
Time per request:       1.708 [ms] (mean, across all concurrent requests)
Transfer rate:          435.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   1.9      4      12
Processing:     3   13   3.3     13      27
Waiting:        3   13   3.3     12      27
Total:          4   17   4.0     17      31

Percentage of the requests served within a certain time (ms)
  50%     17
  66%     17
  75%     18
  80%     19
  90%     21
  95%     24
  98%     29
  99%     29
 100%     31 (longest request)