benchmark/one.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking granz.channel.it22.com (be patient).....done


Server Software:        nginx/1.14.2
Server Hostname:        granz.channel.it22.com
Server Port:            80

Document Path:          /one
Document Length:        625 bytes

Concurrency Level:      10
Time taken for tests:   0.170 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      76200 bytes
HTML transferred:       62500 bytes
Requests per second:    587.51 [#/sec] (mean)
Time per request:       17.021 [ms] (mean)
Time per request:       1.702 [ms] (mean, across all concurrent requests)
Transfer rate:          437.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   2.0      3       9
Processing:     4   12   2.5     12      19
Waiting:        0   12   2.7     12      19
Total:          4   16   3.0     16      21

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     17
  75%     18
  80%     18
  90%     21
  95%     21
  98%     21
  99%     21
 100%     21 (longest request)