benchmark/rr-weight.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking granz.channel.it22.com (be patient)


Server Software:        nginx/1.14.2
Server Hostname:        granz.channel.it22.com
Server Port:            80

Document Path:          /rr-weight
Document Length:        625 bytes

Concurrency Level:      10
Time taken for tests:   0.351 seconds
Complete requests:      200
Failed requests:        57
   (Connect: 0, Receive: 0, Length: 57, Exceptions: 0)
Total transferred:      152343 bytes
HTML transferred:       124943 bytes
Requests per second:    569.35 [#/sec] (mean)
Time per request:       17.564 [ms] (mean)
Time per request:       1.756 [ms] (mean, across all concurrent requests)
Transfer rate:          423.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    4   1.6      3       9
Processing:     2   13   2.2     13      19
Waiting:        1   13   2.2     13      19
Total:          4   17   2.8     17      24

Percentage of the requests served within a certain time (ms)
  50%     17
  66%     18
  75%     19
  80%     20
  90%     20
  95%     21
  98%     23
  99%     23
 100%     24 (longest request)