benchmark/rr.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking granz.channel.it22.com (be patient)


Server Software:        nginx/1.14.2
Server Hostname:        granz.channel.it22.com
Server Port:            80

Document Path:          /rr
Document Length:        625 bytes

Concurrency Level:      10
Time taken for tests:   0.374 seconds
Complete requests:      200
Failed requests:        66
   (Connect: 0, Receive: 0, Length: 66, Exceptions: 0)
Total transferred:      152334 bytes
HTML transferred:       124934 bytes
Requests per second:    534.82 [#/sec] (mean)
Time per request:       18.698 [ms] (mean)
Time per request:       1.870 [ms] (mean, across all concurrent requests)
Transfer rate:          397.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   1.7      3       8
Processing:     2   15   3.6     14      27
Waiting:        1   14   3.6     14      27
Total:          2   18   4.4     18      33

Percentage of the requests served within a certain time (ms)
  50%     18
  66%     19
  75%     20
  80%     21
  90%     22
  95%     27
  98%     32
  99%     33
 100%     33 (longest request)